'use strict';

/*
https://stackoverflow.com/questions/3628588/bus-public-transport-algorithm
봉화10(10:40) 봉화70(11:30)	봉화10:40출발 봉성10:55 명호11:05 재산11:30출발 춘양12:00
봉화70(16:00) 봉화10(16:40)	춘양16:00출발 재산16:40출발 명호16:55 봉성17:05 봉화17:20
봉화10(07:50)	봉화07:50출발 봉성08:05 명호08:15 재산08:40출발 명호08:55 봉성09:05 봉화09:20
봉화10(12:40)	봉화12:40출발 봉성12:55 명호13:05 재산13:40출발 명호13:55 봉성14:05 봉화14:20
봉화10(19:30)	봉화19:30출발 봉성19:45 명호19:55 재산20:10출발 명호20:25 봉성20:35 봉화20:50
봉화11(09:20)	봉화09:20출발 봉성09:35 명호09:45 재산10:00 두전10:30출발 재산11:00출발 명호11:15 봉성11:25 봉화11:40
봉화11(15:50)	봉화15:50출발 봉성16:05 명호16:15 재산16:30 두전17:00출발 재산17:20출발 명호17:35 봉성17:45 봉화18:00
봉화12(06:00)	봉화06:00출발 봉성06:15 명호06:25 재산06:40 동면07:10출발 재산07:40출발 명호07:55 봉성08:05 봉화08:20
봉화12(11:55)	봉화11:55출발 봉성12:10 명호12:20 재산12:35 동면12:55출발 재산13:10출발 명호13:25 봉성13:35 봉화13:50
봉화12(18:15)	봉화18:15출발 봉성18:30 명호18:40 재산18:55 동면19:20출발 재산19:40출발 명호19:55 봉성20:05 봉화20:20
봉화13(14:00)	봉화14:40출발 봉성14:55 명호15:05 재산15:20 모천15:45출발 재산16:00출발 명호16:15 봉성16:25 봉화16:40
봉화14(07:00)	봉화07:00출발 봉성07:15 명호07:30출발 삼동07:40 춘양08:00
봉화50(08:10)	춘양08:10출발 법전08:20 봉화08:40
봉화15(06:20)	봉화06:20출발 봉성06:35 명호06:45 청량산07:00출발 명호07:10 고암07:30 봉성07:40 봉화07:50
봉화16(08:35)	봉화08:35출발 봉성08:50 명호09:00 청량산09:20출발 명호09:30 봉성09:40 봉화09:55
봉화16(13:30)	봉화13:30출발 봉성13:45 명호13:55 청량산14:30출발 명호14:40 봉성14:50 봉화15:10
봉화16(17:40)	봉화17:40출발 봉성17:55 명호18:05 청량산18:20출발 명호18:30 봉성18:40 봉화19:05
봉화18(07:20)	봉화07:20출발 봉성07:45출발 봉화08:15
봉화18(17:00)	봉화17:00출발 봉성17:25출발 봉화17:45
봉화20(19:30)	봉화19:30출발 물야19:45출발 봉화20:00
봉화21-1(09:35)	봉화09:35출발 물야09:50 오전약수탕10:05출발 물야10:10 봉화10:40
봉화21-3(11:20)	봉화11:20출발 물야11:35 오전약수탕12:00출발 물야12:05 봉화12:40
봉화21(12:40)	봉화12:40출발 물야12:55 오전약수탕13:10출발 물야13:15 봉화13:40
봉화21-2(15:20)	봉화15:20출발 물야15:35 오전약수탕16:00출발 물야16:05 봉화16:30
봉화21(16:20)	봉화16:20출발 물야16:35 오전약수탕16:50출발 물야16:55 봉화17:20
봉화21(18:40)	봉화18:40출발 물야18:55 오전약수탕19:10출발 물야19:15 봉화19:40
봉화22(07:20)	봉화07:20출발 물야07:35 오전약수탕07:55출발 물야08:00 봉화08:25
봉화22(14:10)	봉화14:10출발 물야14:25 오전약수탕14:45출발 물야14:50 봉화15:10
봉화23(06:20)	봉화06:20출발 물야06:35 부석06:50출발 물야07:15 봉화07:20
봉화23(08:35)	봉화08:35출발 물야08:50 부석09:10출발 물야09:25 봉화09:40
봉화23(14:50)	봉화14:50출발 물야15:05 부석15:25출발 물야15:40 봉화15:55
봉화23(17:05)	봉화17:05출발 물야17:20 부석17:35출발 물야17:45 봉화18:00
봉화24(06:25)	봉화06:25출발 개단06:55출발 봉화07:20
봉화24(11:00)	봉화11:00출발 개단11:30출발 봉화12:00
봉화24(18:05)	봉화18:05출발 개단18:30출발 봉화18:55
봉화25(06:30)	봉화06:30출발 덕촌06:50출발 봉화07:10
봉화25(13:30)	봉화13:30출발 덕촌13:55출발 봉화14:10
봉화25(18:30)	봉화18:30출발 덕촌18:55출발 봉화19:15
봉화26(06:40)	봉화06:40출발 상운06:55 신라07:30출발 상운08:05 봉화08:20
봉화26(13:10)	봉화13:10출발 상운13:30 신라14:00출발 상운14:25 봉화14:40
봉화27(18:05)	봉화18:05출발 상운18:20 신라19:00출발 상운19:25 봉화19:40
봉화28(07:25)	봉화07:25출발 상운07:35 구천07:40출발 설매07:42 상운07:45 봉화08:00
봉화28(08:55)	봉화08:55출발 상운09:10 구천09:15출발 상운09:20 봉화09:30
봉화28(12:10)	봉화12:10출발 상운12:25 구천12:30출발 상운12:35 봉화12:50

봉화(29)08:50 물야(29-1)09:30 영주(29-1)11:05 물야(29)12:05 봉화(29)12:45
봉화(29)14:00 물야(29-2)14:40 영주(29-2)15:40 물야(29)16:40 봉화(29)17:10

봉화공용터미널 ↔ 봉화역 ↔ 해저1리 ↔ 해저3리 ↔ 창마 ↔ 말문
↔ 두문1리,구마 ↔ 샘실 앞 ↔ 가평 ↔ 물야 ↔ 가평 샘실 앞
↔ 두문1리,구마 ↔ 하황산 ↔ 화천 
(영주) ↔ 삼일주유소 ↔ 동산교회 ↔ 상망동주민센터 ↔ 백마가구 ↔ 장충당약국 ↔ 영주여객
※ 오전 : 봉화 ↔ 물야(화천 경유) ↔ 영주 ↔ 물야 ↔ 봉화 
※ 오후 : 봉화 ↔ 물야 ↔ 영주 ↔ 물야(화천 경유) ↔ 봉화
영주구간 - 유료운행 일반 2,000원

34   봉화08:45 문단09:00 화천09:15 봉화09:30
34-1 봉화15:30 화천15:45 문단16:00 봉화16:15

봉화35(16:45)	봉화16:45출발 상운17:00출발 봉화17:15
봉화36(17:50)	봉화17:50출발 봉성18:05 고암18:15출발 봉성18:20 봉화18:40
봉화37(11:35)	봉화11:35출발 봉성11:50 상운12:05 봉화12:20
봉화37(16:00)	봉화16:00출발 상운16:15 봉성16:30 봉화16:45
봉화38(08:05)	봉화08:05출발 선돌08:15출발 봉화08:25
봉화38(17:10)	봉화17:10출발 선돌17:20출발 봉화17:30
봉화50(19:30)	봉화19:30출발 법전19:55 춘양20:00
봉화51(06:00)	봉화06:00출발 법전06:25 춘양06:40출발 두내07:00 서벽07:15 춘양07:45출발 법전07:55 봉화08:15
봉화51(09:35)	봉화09:35출발 법전10:00 춘양10:20출발 두내10:55 서벽11:05 춘양11:30출발 법전11:40 봉화12:00
봉화51(11:50)	봉화11:50출발 법전12:15 춘양12:40출발 두내13:20 서벽13:35 춘양14:05출발 법전14:15 봉화14:35
봉화51(15:30)	봉화15:30출발 법전15:55 춘양16:10출발 두내16:35 서벽16:50 춘양17:15출발 법전17:25 봉화17:45
봉화52(07:00)	봉화07:00출발 법전07:25 춘양07:30출발 애당리07:50 서벽08:00 하금정08:25 금정08:50 하금정09:05 서벽09:10 춘양09:30출발 법전09:35 봉화10:00
봉화52(16:40)	봉화16:40출발 법전17:05 춘양17:20출발 서벽17:30 하금정17:40 금정18:05 하금정18:20 서벽18:30 애당리18:40 춘양19:00출발 법전19:10 봉화19:30
봉화53(08:50)	봉화08:50출발 법전09:15 춘양09:30출발 서벽09:55 춘양10:20출발 법전10:30 봉화10:50
봉화53(11:00)	봉화11:00출발 법전11:20 춘양11:40출발 서벽12:05 춘양12:30출발 법전12:40 봉화13:00
봉화53(13:40)	봉화13:40출발 법전14:00 춘양14:20출발 서벽14:45 춘양15:15출발 법전15:25 봉화15:45
봉화53(14:20)	봉화14:20출발 법전14:40 춘양15:05출발 서벽15:35 춘양16:00출발 법전16:10 봉화16:30
봉화53(18:20)	봉화18:20출발 법전18:40 춘양19:00출발 서벽19:25 춘양19:50출발 법전20:00 봉화20:20
봉화53(18:55)	봉화18:55출발 법전19:15 춘양19:30출발 서벽19:55 춘양20:10출발 법전20:20 봉화20:40
봉화57(08:00) 봉화58(09:50)	봉화08:00출발 법전08:20 춘양08:35출발 소천08:50 석포09:50출발 소천10:30 춘양11:00
봉화58(13:00) 봉화57(14:25)	춘양13:00출발 석포14:25출발 소천15:05 춘양15:35출발 법전15:45 봉화16:05
봉화71(13:10) 봉화72(14:40)	봉화13:10출발 법전13:30 춘양13:45출발 소천14:40출발 춘양15:20
봉화62(15:30)	춘양15:30출발 대곡16:10출발 춘양17:05
봉화59(17:20)	봉화17:20출발 법전17:40 춘양18:00출발 소천18:40출발 춘양19:20출발 법전19:30 봉화19:50
봉화61(07:30)	남회룡07:30출발 소천07:50 춘양08:30
봉화61(12:40)	춘양12:40출발 소천13:00 남회룡14:30출발 소천15:00 춘양15:30
봉화61(17:50)	춘양17:50출발 소천18:05 남회룡18:50
봉화63(06:40) 봉화50(08:10)	춘양06:40출발 대곡07:00 우련전07:20출발 대곡07:30 춘양08:10출발 봉화08:40
봉화63(09:10) 봉화50(10:50)	춘양09:10출발 대곡09:30 우련전09:50출발 대곡10:00 춘양10:50출발 봉화11:20
봉화50(17:50) 봉화63(18:30)	봉화17:50출발 춘양18:30출발 대곡18:50 우련전19:00출발 대곡19:10 춘양19:30
봉화64(08:00) 봉화50(08:35)	춘양08:00출발 어은동08:15출발 춘양08:35출발 법전08:45 봉화09:05
봉화64(17:10)	춘양17:10출발 어은동17:25출발 춘양17:40
봉화65(06:40)	춘양06:40출발 학산07:00출발 춘양07:15
봉화65(16:20)	춘양16:20출발 학산16:35출발 춘양16:50
봉화66(07:20)	춘양07:20출발 소로리07:40출발 춘양08:00
봉화66(16:55)	춘양16:55출발 소로리17:10출발 춘양17:30
봉화67(06:35)	봉화06:35출발 오암성지07:00출발 봉화07:25
봉화68(08:10) 봉화50(09:05)	춘양08:10출발 삼동08:20 명호08:35출발 삼동08:45 춘양09:05출발 법전09:15 봉화09:35
봉화68(17:30) 봉화50(18:35)	춘양17:30출발 삼동17:55 명호18:05출발 삼동18:15 춘양18:35출발 법전18:45 봉화19:05
봉화50(12:40) 봉화69(13:20)	봉화12:40출발 법전13:00 춘양13:20출발 삼동14:00출발 춘양14:30
*/